# Connecting to the "Airlines" Database

In [1]:
import os
USER = os.environ['POSTGRESQL_USER']
PASSWORD = os.environ['POSTGRESQL_PASSWORD']
POSTGRESQL_HOST = '10.129.0.25'
DBASE_NAME = 'demo'

In [2]:
CONNECT_DATA = 'postgresql://{}:{}@{}/{}'.format(
    USER,
    PASSWORD,
    POSTGRESQL_HOST,
    DBASE_NAME
)

In [3]:
%load_ext sql

# `DISTINCT` Keyword

In [4]:
%%sql $CONNECT_DATA

SELECT DISTINCT arrival_airport, aircraft_code 
FROM Flights AS f
WHERE f.arrival_airport='AER'

7 rows affected.

[('AER', '773'),
 ('AER', '733'),
 ('AER', '763'),
 ('AER', 'CN1'),
 ('AER', 'SU9'),
 ('AER', 'CR2'),
 ('AER', '319')]

This query returns unique combinations of arrival_airport and aircraft_code

In [5]:
%%sql

SELECT arrival_airport, aircraft_code 
FROM Flights AS f
WHERE f.arrival_airport='AER'
LIMIT 5

 * postgresql://reader:***@10.129.0.25/demo
5 rows affected.

[('AER', '773'),
 ('AER', 'CN1'),
 ('AER', '763'),
 ('AER', '763'),
 ('AER', '763')]

If not `LIMIT`ed, this query will return 3791 rows the majority of which are **duplicates**

# Tasks

## Which fare conditions are available for flights from AER to SVO?

In [6]:
%%sql

SELECT DISTINCT fare_conditions
FROM Ticket_flights
WHERE flight_id IN (
    SELECT flight_id
    FROM Flights
    WHERE departure_airport = 'AER' AND arrival_airport = 'SVO'
)

 * postgresql://reader:***@10.129.0.25/demo
3 rows affected.

[('Business',), ('Comfort',), ('Economy',)]

### Same using JOIN

In [7]:
%%sql

SELECT DISTINCT fare_conditions
FROM Tickets t
JOIN Ticket_Flights tf ON t.ticket_no = tf.ticket_no
JOIN Flights f ON tf.flight_id = f.flight_id
WHERE f.departure_airport = 'AER'
  AND f.arrival_airport = 'SVO'

 * postgresql://reader:***@10.129.0.25/demo
3 rows affected.

[('Business',), ('Comfort',), ('Economy',)]

## A list of aircraft models which fly to the Yakutsk AND Abakan cities

In [8]:
%%sql

SELECT DISTINCT model
FROM Aircrafts
WHERE aircraft_code IN (
    SELECT aircraft_code
    FROM Flights
    WHERE arrival_airport IN (
        SELECT airport_code
        FROM Airports
        WHERE city = 'Yakutsk'
    )
)
AND aircraft_code IN (
    SELECT aircraft_code
    FROM Flights
    WHERE arrival_airport IN (
        SELECT airport_code
        FROM Airports
        WHERE city = 'Abakan'
    )
)

 * postgresql://reader:***@10.129.0.25/demo
1 rows affected.

[('Airbus A319-100',)]

### Same using `JOIN`

In [9]:
%%sql

SELECT DISTINCT a.model
FROM Aircrafts AS a
JOIN Flights AS f_y ON a.aircraft_code = f_y.aircraft_code
JOIN Airports AS ap_y ON f_y.arrival_airport = ap_y.airport_code
JOIN Flights AS f_a ON a.aircraft_code = f_a.aircraft_code
JOIN Airports AS ap_a ON f_a.arrival_airport = ap_a.airport_code
WHERE ap_y.city = 'Yakutsk'
  AND ap_a.city = 'Abakan'

 * postgresql://reader:***@10.129.0.25/demo
1 rows affected.

[('Airbus A319-100',)]

## A list of aircraft models which fly to the Yakutsk OR Abakan cities

In [10]:
%%sql

SELECT DISTINCT model
FROM Aircrafts
WHERE aircraft_code IN (
    SELECT aircraft_code
    FROM Flights
    WHERE arrival_airport IN (
        SELECT airport_code
        FROM Airports
        WHERE city = 'Yakutsk'
    )
)
OR aircraft_code IN (
    SELECT aircraft_code
    FROM Flights
    WHERE arrival_airport IN (
        SELECT airport_code
        FROM Airports
        WHERE city = 'Abakan'
    )
)

 * postgresql://reader:***@10.129.0.25/demo
5 rows affected.

[('Airbus A319-100',),
 ('Boeing 737-300',),
 ('Bombardier CRJ-200',),
 ('Cessna 208 Caravan',),
 ('Sukhoi Superjet-100',)]

### Same using `JOIN`

In [11]:
%%sql

SELECT DISTINCT a.model
FROM Aircrafts AS a
JOIN Flights AS f ON a.aircraft_code = f.aircraft_code
JOIN Airports AS ap ON f.arrival_airport = ap.airport_code
WHERE ap.city = 'Yakutsk' 
OR ap.city = 'Abakan'

 * postgresql://reader:***@10.129.0.25/demo
5 rows affected.

[('Bombardier CRJ-200',),
 ('Sukhoi Superjet-100',),
 ('Airbus A319-100',),
 ('Cessna 208 Caravan',),
 ('Boeing 737-300',)]

## A list of aircrafts which DON’T fly to Yakutsk city

In [12]:
%%sql

SELECT DISTINCT model
FROM Aircrafts
WHERE aircraft_code NOT IN (
    SELECT aircraft_code
    FROM Flights
    WHERE arrival_airport IN (
        SELECT airport_code
        FROM Airports
        WHERE city = 'Yakutsk'
    )
)

 * postgresql://reader:***@10.129.0.25/demo
6 rows affected.

[('Airbus A320-200',),
 ('Airbus A321-200',),
 ('Boeing 737-300',),
 ('Boeing 767-300',),
 ('Boeing 777-300',),
 ('Cessna 208 Caravan',)]

## Find out airport codes related to Mrs. 'ELLA DMITRIEVA'  - from where and to where she flew.

In [13]:
%%sql

SELECT DISTINCT departure_airport, arrival_airport
FROM Flights
WHERE flight_id IN (
    SELECT flight_id
    FROM Ticket_flights
    WHERE ticket_no IN (
        SELECT ticket_no
        FROM Tickets
        WHERE passenger_name = 'ELLA DMITRIEVA'
    )
)

 * postgresql://reader:***@10.129.0.25/demo
7 rows affected.

[('DME', 'HMA'),
 ('DME', 'UUS'),
 ('HMA', 'DME'),
 ('MQF', 'SVX'),
 ('SVO', 'SVX'),
 ('SVX', 'MQF'),
 ('SVX', 'SVO')]

### Same with `JOIN`

In [14]:
%%sql

SELECT DISTINCT f.departure_airport, f.arrival_airport
FROM Flights AS f
JOIN Ticket_Flights AS tf ON f.flight_id = tf.flight_id
JOIN Tickets AS t ON tf.ticket_no = t.ticket_no
WHERE t.passenger_name = 'ELLA DMITRIEVA'

 * postgresql://reader:***@10.129.0.25/demo
7 rows affected.

[('DME', 'HMA'),
 ('DME', 'UUS'),
 ('HMA', 'DME'),
 ('MQF', 'SVX'),
 ('SVO', 'SVX'),
 ('SVX', 'MQF'),
 ('SVX', 'SVO')]

# Conclusions:
- Going backwards from the desired values on the schema was really helpful when constructing the query
- I found that nested queries take longer to process than `JOIN`s
- I could have looked up the airport codes separately (`'YKS'` and `'ABA'`) but that would not be one query